EDT/УТ/src/Documents/ИзменениеДатыДоставки/ИзменениеДатыДоставки.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ИзменениеДатыДоставки</name>
  <basedOn>Document.новаОтчетВодителя</basedOn>
  <registerRecords>InformationRegister.СостоянияЗаказов</registerRecords>
  <registerRecords>InformationRegister.ДатыДоставок</registerRecords>
  <attributes>
    <name>Доставка</name>
    <type>
      <types>BusinessProcessRef.новаМестнаяДоставка</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаДоставки</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КорректироватьДатуВАдминке</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПричинаИзмененияДаты</name>
    <type>
      <types>EnumRef.ПричиныИзмененияДатыДоставки</types>
    </type>
  </attributes>
  <attributes>
    <name>Накладная003</name>
    <type>
      <types>DocumentRef.Накладная003</types>
    </type>
  </attributes>
  <attributes>
    <name>Заказ</name>
    <type>
      <types>DocumentRef.РеализацияТоваровУслуг</types>
    </type>
  </attributes>
  <attributes>
    <name>axi</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ВыгруженоВOZONE</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаДоставкиСтарая</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИнициаторСостояния</name>
    <type>
      <types>EnumRef.ИнициаторыСостояния</types>
    </type>
  </attributes>
  <attributes>
    <name>ПричинаОтказаПереноса</name>
    <type>
      <types>CatalogRef.ПричиныОтказаПереноса</types>
    </type>
  </attributes>
  <attributes>
    <name>Рейс</name>
    <type>
      <types>DocumentRef.Рейс</types>
    </type>
  </attributes>
  <attributes>
    <name>ТерминалОбработки</name>
    <type>
      <types>CatalogRef.РегиональныеТерминалы</types>
    </type>
  </attributes>
  <attributes>
    <name>ЗагрузкаСТСД</name>
    <type>
      <types>DocumentRef.ЗагрузкаСТСД</types>
    </type>
  </attributes>
  <attributes>
    <name>ОтчетВодителя</name>
    <type>
      <types>DocumentRef.новаОтчетВодителя</types>
    </type>
  </attributes>
</mdclass:Document>

EDT/УТ/src/InformationRegisters/ДатыДоставок/ДатыДоставок.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ДатыДоставок</name>
  <informationRegisterPeriodicity>Second</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>ДатаДоставки</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </resources>
  <resources>
    <name>ДатаДоставкиСтарая</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Доставка</name>
    <type>
      <types>BusinessProcessRef.новаМестнаяДоставка</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Заказ</name>
    <type>
      <types>DocumentRef.РеализацияТоваровУслуг</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ПричинаИзмененияДаты</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>ПричинаИзмененияДатыСпр</name>
    <type>
      <types>EnumRef.ПричиныИзмененияДатыДоставки</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

EDT/УТ/src/InformationRegisters/СостоянияЗаказов/СостоянияЗаказов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>СостоянияЗаказов</name>
  <informationRegisterPeriodicity>RecorderPosition</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>РезультатДоставки</name>
    <type>
      <types>CatalogRef.новаРезультатМестнойДоставки</types>
    </type>
  </resources>
  <resources>
    <name>ПричинаНеВыполнения</name>
    <type>
      <types>CatalogRef.ПричиныНеВыполненияДоставки</types>
    </type>
  </resources>
  <resources>
    <name>ПричинаОтказа</name>
    <type>
      <types>CatalogRef.ПричиныОтказаПереноса</types>
    </type>
  </resources>
  <resources>
    <name>ДатаПереноса</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </resources>
  <resources>
    <name>Экспедитор_КУдалению</name>
    <type>
      <types>CatalogRef.новаЭкспедиторы</types>
    </type>
  </resources>
  <resources>
    <name>Водитель_КУдалению</name>
    <type>
      <types>CatalogRef.новаВодители</types>
    </type>
  </resources>
  <resources>
    <name>СторонаПретензий</name>
    <type>
      <types>EnumRef.СторонаПретензий</types>
    </type>
  </resources>
  <resources>
    <name>Инициатор</name>
    <type>
      <types>EnumRef.ИнициаторыСостояния</types>
    </type>
  </resources>
  <resources>
    <name>Рейс</name>
    <type>
      <types>DocumentRef.Рейс</types>
    </type>
  </resources>
  <resources>
    <name>ДатаДоставки</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Доставка</name>
    <type>
      <types>BusinessProcessRef.новаМестнаяДоставка</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Заказ</name>
    <type>
      <types>DocumentRef.РеализацияТоваровУслуг</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

EDT/УТ/src/InformationRegisters/ДополнительныеПараметрыЗаказа/ДополнительныеПараметрыЗаказа.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ДополнительныеПараметрыЗаказа</name>
  <resources>
    <name>ОценочнаяСтоимость</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>КОплатеКлиентом</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>СкладМагазина</name>
    <type>
      <types>CatalogRef.СкладыМагазинов</types>
    </type>
  </resources>
  <resources>
    <name>ПричинаОтклоненияЗаказа</name>
    <type>
      <types>CatalogRef.ПричиныОтклоненияЗаказаВСистеме</types>
    </type>
  </resources>
  <resources>
    <name>ЧастичныйВыкупЗапрещен</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>СОжиданием</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>КОплатеКлиентомИзмененное</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>okey</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>ДатаОтгрузки</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </resources>
  <resources>
    <name>ШтрихкодOZON</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>30</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>nameOZON</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>ВозвратЗапрещен</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ПодъемОплачен</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>РасстояниеОтБазыПоДорогам</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>КатегорияДляРасчетаЗП</name>
    <type>
      <types>CatalogRef.КатегорииДоставки2014</types>
    </type>
  </resources>
  <resources>
    <name>ПравилоСопоставленияКатегории</name>
    <type>
      <types>CatalogRef.ПравилаСопоставленияКатегорийЗаказовДляРасчетаЗП</types>
    </type>
  </resources>
  <resources>
    <name>ПредварительноеЗакрытие</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ДополнительныйНомерЗаказа</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>ТарифицируемыйВес</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>СтавкаНДСФЗПоДоставке</name>
    <type>
      <types>CatalogRef.СтавкиНДСФЗ54</types>
    </type>
  </resources>
  <resources>
    <name>EmailКлиента</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>МетодОплатыПодъемаЗаказа</name>
    <type>
      <types>EnumRef.МетодыОплатыПодъёмаЗаказа</types>
    </type>
  </resources>
  <resources>
    <name>ТарифнаяСеткаПодъемаЗаказов</name>
    <type>
      <types>CatalogRef.ТарифыПодъемаЗаказовНаЭтаж</types>
    </type>
  </resources>
  <resources>
    <name>КатегорияДляРасчетаЗП_Миго</name>
    <type>
      <types>CatalogRef.мгКатегорииЗаказов</types>
    </type>
  </resources>
  <resources>
    <name>СхемаЛогистическихБрейков</name>
    <type>
      <types>CatalogRef.СхемыЛогистическихБрейков</types>
    </type>
  </resources>
  <resources>
    <name>ЛогистическийБрейк</name>
    <type>
      <types>CatalogRef.ЛогистическиеБрейки</types>
    </type>
  </resources>
  <resources>
    <name>Доставка</name>
    <type>
      <types>BusinessProcessRef.новаМестнаяДоставка</types>
    </type>
  </resources>
  <resources>
    <name>Смена</name>
    <type>
      <types>CatalogRef.Смены</types>
    </type>
  </resources>
  <resources>
    <name>Широта</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>20</precision>
        <scale>13</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Долгота</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>20</precision>
        <scale>13</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>КодИдентификацииКлиента</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>ПолучательЗаказа</name>
    <type>
      <types>CatalogRef.ПолучателиЗаказов</types>
    </type>
  </resources>
  <resources>
    <name>ТребуетсяПредъявлениеУдостоверяющегоДокумента</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ТарифРасчетаСтоимостиДоставки</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>11</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>НегабаритныйЗаказ</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ПодписаниеИВозвратСопрДокументов</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ВнешнийОператорМаршрутизации</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </resources>
  <resources>
    <name>Агрегатор</name>
    <type>
      <types>CatalogRef.Маркетплейсы</types>
    </type>
  </resources>
  <resources>
    <name>ТарификацияПоОбъемномуВесу</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ТарифицируемыйОбъемныйВес</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ПунктПВЗ</name>
    <type>
      <types>CatalogRef.ПунктыПВЗ</types>
    </type>
  </resources>
  <resources>
    <name>УровеньОбслуживанияЗаказа</name>
    <type>
      <types>EnumRef.УровниОбслуживания</types>
    </type>
  </resources>
  <resources>
    <name>СсылкаНаОтслеживание</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>ДатаСозданияЗаказа</name>
    <type>
      <types>Date</types>
    </type>
  </resources>
  <resources>
    <name>ГабаритнаяХарактеристикаОпределенияЛогБрейка</name>
    <type>
      <types>EnumRef.ГабаритныеХарактеристикиЗаказа</types>
    </type>
  </resources>
  <dimensions>
    <name>Заказ</name>
    <type>
      <types>DocumentRef.РеализацияТоваровУслуг</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

EDT/УТ/src/Enums/ПричиныИзмененияДатыДоставки/ПричиныИзмененияДатыДоставки.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ПричиныИзмененияДатыДоставки</name>
  <enumValues>
    <name>ВыгрузкаИзАдминки</name>
  </enumValues>
  <enumValues>
    <name>НеПривезлиСоСклада</name>
  </enumValues>
  <enumValues>
    <name>ПереносВСвязиСПревышениемЛимита</name>
  </enumValues>
  <enumValues>
    <name>ВыгрузкаИзСистемыАксиомус</name>
  </enumValues>
  <enumValues>
    <name>ГрупповаяОбработка</name>
  </enumValues>
  <enumValues>
    <name>ОприходованиеЗаказаСоСдвигомДатыДоставки</name>
  </enumValues>
  <enumValues>
    <name>СдвигДатыОтклоненногоЗаказаПриЕгоПоступлении</name>
  </enumValues>
  <enumValues>
    <name>ВыполнениеЗаказаСПеренесеннойДатойДоставки</name>
  </enumValues>
  <enumValues>
    <name>ПереносДатыДоставкиПриОтменеЗаказа</name>
  </enumValues>
  <enumValues>
    <name>ПереносДатыДоставкиЗаказаПоДаннымКалендаряДоставкиЗоны_СозданиеЗаказа</name>
  </enumValues>
  <enumValues>
    <name>ПереносДатыДоставкиЗаказаПоДаннымКалендаряДоставкиЗоны_ПоступлениеНаСклад</name>
  </enumValues>
</mdclass:Enum>

EDT/УТ/src/Documents/ИзменениеДатыДоставки/ObjectModule.bsl
Процедура ОбработкаПроведения(Отказ, Режим)
	//{{__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!
	//Подкл = Евген.СоздатьПодключениеКИнтернетМагазину(); 
	// регистр ДатыДоставок
	Движения.ДатыДоставок.Записывать = Истина;
	Движения.ДатыДоставок.Очистить();
	Движение = Движения.ДатыДоставок.Добавить();
	Движение.Период = Дата;
	Движение.Доставка = Доставка;
	Движение.Заказ = Заказ;
	Движение.ДатаДоставки = ДатаДоставки;
	Движение.ПричинаИзмененияДатыСпр = ПричинаИзмененияДаты;

	Если ЗначениеЗаполнено(Доставка) Тогда 
		НомерЗаказа = Доставка.Номер;
	Иначе
		НомерЗаказа = Заказ.Номер;
	КонецЕсли;
	
	//Асеев 27.11.2020 (Задача № 4359)>>> этот код не используется т.к. не используются статусы НеПривезлиСоСклада и ВыгрузкаИзСистемыАксиомус
	//// Задача № 2813
	//СтатусКОтправке = Неопределено;
	//КомментарийСтатуса = ""; 
	//ОбъектСохраненияСтатуса = Неопределено;
	//Если ПричинаИзмененияДаты = Перечисления.ПричиныИзмененияДатыДоставки.НеПривезлиСоСклада Тогда
	//	СтатусКОтправке = 213;
	//	КомментарийСтатуса = "изменение даты доставок (не привезли со склада)";
	//	ОбъектСохраненияСтатуса = Доставка;
	//ИначеЕсли ПричинаИзмененияДаты = Перечисления.ПричиныИзмененияДатыДоставки.ВыгрузкаИзСистемыАксиомус Тогда
	//	СтатусКОтправке = 232;
	//	КомментарийСтатуса = "изменение даты доставок (данные получены из системы Аксиомус)";
	//	ОбъектСохраненияСтатуса = Заказ;
	//КонецЕсли;
	//
	//Если Не СтатусКОтправке = Неопределено Тогда
	//	ИзменениеДатДоставок();				
	//	Если РаботаСоСтатусамиЗаказовСервер.СохранитьСтатус(ОбъектСохраненияСтатуса, СтатусКОтправке, Ссылка,,ТерминалОбработки) Тогда
	//	//Задача № 3027	//Если lem.СохранитьСтатус(ОбъектСохраненияСтатуса, СтатусКОтправке, Ссылка) Тогда
	//	
	//		ДопПараметрыСтатуса = mas.ДобавитьДополнительныйПараметрСтатуса("ProcessingTerminal", Число(ТерминалОбработки.Код)); // Задача № 3027

	//		//CeHbKA #3227 21.06.2019
	//		Если (СтатусКОтправке = 232) И (НЕ ПричинаОтказаПереноса.Пустая()) Тогда
	//			ДопПараметрыСтатуса = mas.ДобавитьДополнительныйПараметрСтатуса("ReasonId", СокрЛП(ПричинаОтказаПереноса.Код), ДопПараметрыСтатуса); 
	//			ДопПараметрыСтатуса = mas.ДобавитьДополнительныйПараметрСтатуса("ReasonRefusal", СокрЛП(ПричинаОтказаПереноса.Наименование), ДопПараметрыСтатуса); // Задача № 3027
	//		КонецЕсли; 
	//		//CeHbKA #3227 21.06.2019
	//		
	//		МассивСтатусов = mas.ДобавитьПараметрыЗаказаДляУстановкиСтатуса(НомерЗаказа, СтатусКОтправке, КомментарийСтатуса,,,,ДопПараметрыСтатуса);
	//		СтруктураВозврата = mas.ОтправитьМассивСтатусовЗаказов(МассивСтатусов);
	//	КонецеСли;
	//КонецеСли;
	//// Задача № 2813
	//Асеев 27.11.2020 (Задача № 4359)<<<

	//Асеев 27.11.2020 (Задача № 4359)>>>
	//Сообщить("Отладка: Перепроведение = " + ДополнительныеСвойства.Свойство("Перепроведение"));
	Если КорректироватьДатуВАдминке И Не ДополнительныеСвойства.Свойство("Перепроведение") Тогда
		//Сообщить("УстановитьДатуВАдминке " + Заказ.Номер + " " + ДатаДоставки);
		//УстановитьДатуВАдминке(Заказ.Номер, ДатаДоставки);//вынесена на сервер
		Who = Неопределено;
		Если СокрЛП(ПараметрыСеанса.ТекущийПользователь.Код) = "НеАвторизован" Тогда
			Если ПричинаИзмененияДаты = Перечисления.ПричиныИзмененияДатыДоставки.ОприходованиеЗаказаСоСдвигомДатыДоставки Тогда
				Who = "Автоперенос при поступлении";
			КонецЕсли;
		КонецЕсли;
			
		МаршрутизацияЗаказовСервер.СдвигДатыЗаказа(Заказ, Доставка, ДатаДоставки, Who);
		
		СтатусКОтправке = 232;
		КомментарийСтатуса = "изменение даты доставок";
		ОбъектСохраненияСтатуса = Заказ;
		Если РаботаСоСтатусамиЗаказовСервер.СохранитьСтатус(ОбъектСохраненияСтатуса, СтатусКОтправке, Ссылка,,ТерминалОбработки) Тогда
			
			ДопПараметрыСтатуса = mas.ДобавитьДополнительныйПараметрСтатуса("ProcessingTerminal", Число(ТерминалОбработки.Код)); // Задача № 3027

			//CeHbKA #3227 21.06.2019
			Если (СтатусКОтправке = 232) И (НЕ ПричинаОтказаПереноса.Пустая()) Тогда
				ДопПараметрыСтатуса = mas.ДобавитьДополнительныйПараметрСтатуса("ReasonId", СокрЛП(ПричинаОтказаПереноса.Код), ДопПараметрыСтатуса); 
				ДопПараметрыСтатуса = mas.ДобавитьДополнительныйПараметрСтатуса("ReasonRefusal", СокрЛП(ПричинаОтказаПереноса.Наименование), ДопПараметрыСтатуса); // Задача № 3027
			КонецЕсли; 
			//CeHbKA #3227 21.06.2019
			
			МассивСтатусов = mas.ДобавитьПараметрыЗаказаДляУстановкиСтатуса(НомерЗаказа, СтатусКОтправке, КомментарийСтатуса,,,,ДопПараметрыСтатуса);
			СтруктураВозврата = mas.ОтправитьМассивСтатусовЗаказов(МассивСтатусов);
			
		КонецЕсли;
	КонецЕсли;
	//Асеев 27.11.2020 (Задача № 4359)<<<
	
	
	
	// Отключено в рамках Задача № 2813	
	//Если ПричинаИзмененияДаты = Перечисления.ПричиныИзмененияДатыДоставки.НеПривезлиСоСклада Тогда
	//	ИзменениеДатДоставок();
	//	СтрЗапроса = "EXEC import_setOrderStatusIDFrom1C " + Формат(Сокрлп(НомерЗаказа), "ЧГ=") + ",213,'изменение даты доставок (не привезли со склада)'";
	//	Если lem.СохранитьСтатус(Доставка, 213, Ссылка) Тогда
	//		Евген.ЗапросКИнтернетМагазину(СтрЗапроса, Подкл);
	//	КонецеСли;	
	//// Михушкин --->> 
	//ИначеЕсли ПричинаИзмененияДаты = Перечисления.ПричиныИзмененияДатыДоставки.ВыгрузкаИзСистемыАксиомус Тогда
	//	ИзменениеДатДоставок();
	//	СтрЗапроса = "EXEC import_setOrderStatusIDFrom1C " + Формат(Сокрлп(НомерЗаказа), "ЧГ=") + ",232,'изменение даты доставок (данные получены из системы Аксиомус)'";
	//	Если lem.СохранитьСтатус(Заказ, 232, Ссылка) Тогда
	//		Евген.ЗапросКИнтернетМагазину(СтрЗапроса, Подкл);
	//	КонецеСли;
	//// <<--- Михушкин 	
	//КонецеСли;
	//
	// Отключено в рамках Задача № 2813
		
	//ЗапросОзон = Новый Запрос("ВЫБРАТЬ
	//                          |	ЕСТЬNULL(ДополнительныеПараметрыЗаказа.ШтрихкодOZON, """") КАК ШтрихкодOZON,
	//                          |	ДополнительныеПараметрыЗаказа.Заказ
	//                          |ИЗ
	//                          |	РегистрСведений.ДополнительныеПараметрыЗаказа КАК ДополнительныеПараметрыЗаказа
	//                          |ГДЕ
	//                          |	ДополнительныеПараметрыЗаказа.Заказ.Номер = &НомерЗаказа");
	//ЗапросОзон.УстановитьПараметр("НомерЗаказа", НомерЗаказа);	
	//РезОзон = ЗапросОзон.Выполнить().Выбрать();
	//
	//Если РезОзон.Следующий() И РезОзон.ШтрихкодOZON <> "" И НачалоДня(ДатаДоставки) <> НачалоДня(Заказ.Дата) Тогда
	//	
	//	Запрос = новый Запрос("ВЫБРАТЬ
	//	                      |	ИзменениеДатыДоставки.Ссылка
	//	                      |ИЗ
	//	                      |	Документ.ИзменениеДатыДоставки КАК ИзменениеДатыДоставки
	//	                      |ГДЕ
	//	                      |	ИзменениеДатыДоставки.Проведен
	//	                      |	И ИзменениеДатыДоставки.Доставка = &Доставка
	//	                      |	И ИзменениеДатыДоставки.Ссылка <> &Ссылка");
	//	Запрос.УстановитьПараметр("Доставка", Доставка);
	//	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	//	Если НЕ Запрос.Выполнить().Пустой() Тогда	
	//	
	//		Д = Доставка.ПолучитьОбъект();
	//		Д.Дата = ДатаДоставки;
	//		
	//		ЧН = Час(Д.ВремяОтправленияС);
	//		ЧК = Час(Д.ВремяОтправленияПо);
	//		
	//		МН = Минута(Д.ВремяОтправленияС);
	//		МК = Минута(Д.ВремяОтправленияПо);
	//		
	//		ЧН_ = Час(Д.ВремяПрибытияС);
	//		ЧК_ = Час(Д.ВремяПрибытияПо);
	//		
	//		МН_ = Минута(Д.ВремяПрибытияС);
	//		МК_ = Минута(Д.ВремяПрибытияПо);
	//		
	//		ВремяПрибытияС = Формат(День(ДатаДоставки), "ЧЦ=2; ЧВН=; ЧГ=") + "." + Формат(Месяц(ДатаДоставки), "ЧЦ=2; ЧВН=; ЧГ=")  + "." + Формат(Год(ДатаДоставки), "ЧГ=") + " " +Формат(ЧН_, "ЧЦ=2; ЧН=00; ЧВН=; ЧГ=") + ":" + Формат(МН_, "ЧЦ=2; ЧН=00; ЧВН=; ЧГ=");
	//		ВремяПрибытияПо = Формат(День(ДатаДоставки), "ЧЦ=2; ЧВН=; ЧГ=") + "." + Формат(Месяц(ДатаДоставки), "ЧЦ=2; ЧВН=; ЧГ=")  + "." + Формат(Год(ДатаДоставки), "ЧГ=") + " " +Формат(ЧК_, "ЧЦ=2; ЧН=00; ЧВН=; ЧГ=") + ":" + Формат(МК_, "ЧЦ=2; ЧН=00; ЧВН=; ЧГ=");
	//		
	//		Рез = oz_РаботаССервисом.PostingDeliveryDateChange(РезОзон.ШтрихкодOZON, ВремяПрибытияС, ВремяПрибытияПо, РезОзон.Заказ, Ссылка);	
	//		
	//		ВыгруженоВOZONE = Истина;
	//	
	//	КонецЕсли;
	//	
	//КонецЕсли;
	
	//Зап = Новый Запрос;
	//зап.Текст = "ВЫБРАТЬ
	//            |	ИзменениеДатыДоставки.Ссылка
	//            |ИЗ
	//            |	Документ.ИзменениеДатыДоставки КАК ИзменениеДатыДоставки
	//            |ГДЕ
	//            |	ИзменениеДатыДоставки.Доставка = &Доставка
	//            |	И ИзменениеДатыДоставки.Ссылка <> &Ссылка";
	//зап.УстановитьПараметр("Доставка", Доставка);			
	//зап.УстановитьПараметр("Ссылка", Ссылка);			
	//Рез = Зап.Выполнить();
	//
	//Если не Рез.Пустой() Тогда
		Движения.СостоянияЗаказов.Записывать = Истина;
		Движения.СостоянияЗаказов.Очистить();
	//Асеев 16.06.2021 (Задача № 4587)>>>
	Если ПричинаИзмененияДаты <> Перечисления.ПричиныИзмененияДатыДоставки.ВыполнениеЗаказаСПеренесеннойДатойДоставки
	//Асеев 16.06.2021 (Задача № 4587)<<<
		//Асеев 12.04.2022 (Задача № 4779)>>>
		И ПричинаИзмененияДаты <> Перечисления.ПричиныИзмененияДатыДоставки.ПереносДатыДоставкиПриОтменеЗаказа
		И ПричинаИзмененияДаты <> Перечисления.ПричиныИзмененияДатыДоставки.СдвигДатыОтклоненногоЗаказаПриЕгоПоступлении Тогда
		//Асеев 12.04.2022 (Задача № 4779)<<<
		Нов = Движения.СостоянияЗаказов.Добавить();
		Нов.Период = Дата;
		Нов.Заказ = Заказ;
		Нов.Доставка = Доставка;
		Нов.ПричинаНеВыполнения = Справочники.ПричиныНеВыполненияДоставки.ПереносДоставки;
		Нов.РезультатДоставки = справочники.новаРезультатМестнойДоставки.НеВыполнена;
		
		//Задача № 2991
		Нов.ПричинаОтказа = ПричинаОтказаПереноса;
		Нов.Рейс = Рейс;
		Нов.ДатаДоставки = Рейс.ДатаРейса;
		
		Если  Не ЗначениеЗаполнено(Рейс) Тогда
			Нов.ДатаДоставки =  Заказ.Дата;
		КонецЕсли;

		//Задача № 2991
	КонецЕсли;	
		
	//КонецЕСли;	
	//}}__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
	
КонецПроцедуры


Процедура УстановитьДатуВАдминке(НомерЗ, ДатаЗ, ОтвязатьАвто = Ложь)
	Попытка
		ПодключениеКМагазину = Евген.СоздатьПодключениеКИнтернетМагазину(); 
	Исключение
		НормальныйХодВыполнения = Ложь;
		Возврат;
	КонецПопытки;
	
	// ++Задача № 3381	
	//Ткст = "
	//|UPDATE _order
	//|SET DeliveryDate = '" + Евген.ДатаВSQL(ДатаЗ, Ложь) + "'
	//| WHERE orderId = " + Формат(НомерЗ, "ЧГ=") + "
	//|EXEC mp_saveOrderHistory " + Формат(НомерЗ, "ЧГ=");
	//Евген.ЗапросКИнтернетМагазину(Ткст, ПодключениеКМагазину);
	ПараметрыЗаказа = Новый Структура("OrderId, DeliveryDate, Who",
	Число(НомерЗ), ДатаЗ, СокрЛП(ПараметрыСеанса.ТекущийПользователь));
	
	ПараметрыЗапроса = новый Массив;
	ПараметрыЗапроса.Добавить(ПараметрыЗаказа);
	
	Если ПараметрыСеанса.ЭтоТестоваяСреда Тогда
		ФайлДляКонтроля = "D:\tmp\SetOrdersDeliveryDate_" + СокрЛП(НомерЗ) + ".json";
		ТолькоСохранитьФайл = Ложь;
	Иначе
		ФайлДляКонтроля = Неопределено;
		ТолькоСохранитьФайл = Ложь;
	КонецЕсли;

	РезультатОтправки = ИнтеграцияСАдминкойWEBСервис.ВыполнитьЗапросКАдминке(
	Перечисления.ВидыЗапросовWEBСервис.SetOrdersDeliveryDateResult,
	ПараметрыЗапроса,
	ФайлДляКонтроля, 
	ТолькоСохранитьФайл);
	// --Задача № 3381
	
    ////Серегин М.В. 30.07.2015 17:21:53 старый код
    //Ткст = "
    //|UPDATE _order
    //|SET carid = 0
    //| WHERE orderId = " + Формат(НомерЗ, "ЧГ=") + "
    //|EXEC mp_saveOrderHistory " + Формат(НомерЗ, "ЧГ=");
    //Евген.ЗапросКИнтернетМагазину(Ткст, ПодключениеКМагазину);
    ////Серегин М.В. 30.07.2015 17:22:01 новый
	//Асеев 27.11.2020 (Задача № 4359)>>>
	Если ОтвязатьАвто Тогда
	//Асеев 27.11.2020 (Задача № 4359)<<<
		Ткст = "
		|EXEC p1c_removeCarriageFromOrder " + Формат(НомерЗ, "ЧГ=") + "
		|EXEC mp_saveOrderHistory " + Формат(НомерЗ, "ЧГ=");
		Евген.ЗапросКИнтернетМагазину(Ткст, ПодключениеКМагазину);
	КонецЕсли;
    //Серегин М.В. 30.07.2015 17:22:14 
    
	
КонецПроцедуры	

Процедура ОткатитьДатуДоставки()
	
	Стр = Новый Структура;
	Стр.Вставить("Доставка", Доставка);
	НайПред = РегистрыСведений.ДатыДоставок.ПолучитьПоследнее(Дата - 1, Стр);
	
	Если ЗначениеЗаполнено(НайПред.ДатаДоставки) Тогда
		
		ЗапросДатаПозже = Новый Запрос("ВЫБРАТЬ
		                               |	ДатыДоставок.Период,
		                               |	ДатыДоставок.Регистратор,
		                               |	ДатыДоставок.НомерСтроки,
		                               |	ДатыДоставок.Активность,
		                               |	ДатыДоставок.Доставка,
		                               |	ДатыДоставок.Заказ,
		                               |	ДатыДоставок.ПричинаИзмененияДаты,
		                               |	ДатыДоставок.ПричинаИзмененияДатыСпр,
		                               |	ДатыДоставок.ДатаДоставки
		                               |ИЗ
		                               |	РегистрСведений.ДатыДоставок КАК ДатыДоставок
		                               |ГДЕ
		                               |	ДатыДоставок.Период >= &Дата
		                               |	И ДатыДоставок.Заказ = &Заказ
		                               |	И ДатыДоставок.Регистратор <> &Регистратор");
		ЗапросДатаПозже.УстановитьПараметр("Дата", Дата);
		ЗапросДатаПозже.УстановитьПараметр("Заказ", Доставка);
		ЗапросДатаПозже.УстановитьПараметр("Регистратор", Ссылка);
		Рез = ЗапросДатаПозже.Выполнить();
		
		Если Рез.Пустой() Тогда
					
			Д = Доставка.ПолучитьОбъект();
			Д.Дата = НайПред.ДатаДоставки;  
			
			ЧН = Час(Д.ВремяОтправленияС);
			ЧК = Час(Д.ВремяОтправленияПо);
			
			МН = Минута(Д.ВремяОтправленияС);
			МК = Минута(Д.ВремяОтправленияПо);
			
			ЧН_ = Час(Д.ВремяПрибытияС);
			ЧК_ = Час(Д.ВремяПрибытияПо);
			
			МН_ = Минута(Д.ВремяПрибытияС);
			МК_ = Минута(Д.ВремяПрибытияПо);
			
			
			Д.ВремяОтправленияС = Дата(Формат(Год(ДатаДоставки), "ЧГ=") + Формат(Месяц(ДатаДоставки), "ЧЦ=2; ЧВН=; ЧГ=") + Формат(День(ДатаДоставки), "ЧЦ=2; ЧВН=; ЧГ=") + Формат(ЧН, "ЧЦ=2; ЧН=00; ЧВН=; ЧГ=") + Формат(МН, "ЧЦ=2; ЧН=00; ЧВН=; ЧГ=") + "00");
			Д.ВремяОтправленияПо = Дата(Формат(Год(ДатаДоставки), "ЧГ=") + Формат(Месяц(ДатаДоставки), "ЧЦ=2; ЧВН=; ЧГ=") + Формат(День(ДатаДоставки), "ЧЦ=2; ЧВН=; ЧГ=") + Формат(ЧК, "ЧЦ=2; ЧВН=; ЧГ=") + Формат(МК, "ЧЦ=2; ЧВН=; ЧГ=") + "00");
			
			Д.ВремяПрибытияС = Дата(Формат(Год(ДатаДоставки), "ЧГ=") + Формат(Месяц(ДатаДоставки), "ЧЦ=2; ЧВН=; ЧГ=") + Формат(День(ДатаДоставки), "ЧЦ=2; ЧВН=; ЧГ=") + Формат(ЧН_, "ЧЦ=2; ЧН=00; ЧВН=; ЧГ=") + Формат(МН_, "ЧЦ=2; ЧН=00; ЧВН=; ЧГ=") + "00");
			Д.ВремяПрибытияПо = Дата(Формат(Год(ДатаДоставки), "ЧГ=") + Формат(Месяц(ДатаДоставки), "ЧЦ=2; ЧВН=; ЧГ=") + Формат(День(ДатаДоставки), "ЧЦ=2; ЧВН=; ЧГ=") + Формат(ЧК_, "ЧЦ=2; ЧН=00; ЧВН=; ЧГ=") + Формат(МК_, "ЧЦ=2; ЧН=00; ЧВН=; ЧГ=") + "00");
			
			Д.Записать();
			
			Д_ = Документы.РеализацияТоваровУслуг.НайтиПоНомеру(Д.Номер); // , Д.Дата
			
			Если Не Д_.Пустая() Тогда
				
				Док = Д_.ПолучитьОбъект();
				Док.Дата = НайПред.ДатаДоставки;
				УстановитьДатуВАдминке(Д.Номер, ДатаДоставки);
				Док.Записать(РежимЗаписиДокумента.Запись);
				Если Док.Проведен Тогда
					Док.Записать(РежимЗаписиДокумента.Проведение);
				КонецеСли;
				
			КонецеСли;	
			
		КонецЕсли;
		
	КонецеСли;
	
КонецПроцедуры	


Процедура ИзменениеДатДоставок()
	
	//Нов = Движения.ДатыДоставок.Добавить();
	//Нов.Доставка = Доставка;
	//Нов.ДатаДоставки = ДатаДоставки;
	//Нов.Период = Дата;
	
	Д = Доставка.ПолучитьОбъект();
	Д.Дата = ДатаДоставки;
	
	ЧН = Час(Д.ВремяОтправленияС);
	ЧК = Час(Д.ВремяОтправленияПо);
	
	МН = Минута(Д.ВремяОтправленияС);
	МК = Минута(Д.ВремяОтправленияПо);
	
	ЧН_ = Час(Д.ВремяПрибытияС);
	ЧК_ = Час(Д.ВремяПрибытияПо);
	
	МН_ = Минута(Д.ВремяПрибытияС);
	МК_ = Минута(Д.ВремяПрибытияПо);
	
	
	Д.ВремяОтправленияС = Дата(Формат(Год(ДатаДоставки), "ЧГ=") + Формат(Месяц(ДатаДоставки), "ЧЦ=2; ЧВН=; ЧГ=") + Формат(День(ДатаДоставки), "ЧЦ=2; ЧВН=; ЧГ=") + Формат(ЧН, "ЧЦ=2; ЧН=00; ЧВН=; ЧГ=") + Формат(МН, "ЧЦ=2; ЧН=00; ЧВН=; ЧГ=") + "00");
	Д.ВремяОтправленияПо = Дата(Формат(Год(ДатаДоставки), "ЧГ=") + Формат(Месяц(ДатаДоставки), "ЧЦ=2; ЧВН=; ЧГ=") + Формат(День(ДатаДоставки), "ЧЦ=2; ЧВН=; ЧГ=") + Формат(ЧК, "ЧЦ=2; ЧН=00; ЧВН=; ЧГ=") + Формат(МК, "ЧЦ=2; ЧН=00; ЧВН=; ЧГ=") + "00");
	
	Д.ВремяПрибытияС = Дата(Формат(Год(ДатаДоставки), "ЧГ=") + Формат(Месяц(ДатаДоставки), "ЧЦ=2; ЧВН=; ЧГ=") + Формат(День(ДатаДоставки), "ЧЦ=2; ЧВН=; ЧГ=") + Формат(ЧН_, "ЧЦ=2; ЧН=00; ЧВН=; ЧГ=") + Формат(МН_, "ЧЦ=2; ЧН=00; ЧВН=; ЧГ=") + "00");
	Д.ВремяПрибытияПо = Дата(Формат(Год(ДатаДоставки), "ЧГ=") + Формат(Месяц(ДатаДоставки), "ЧЦ=2; ЧВН=; ЧГ=") + Формат(День(ДатаДоставки), "ЧЦ=2; ЧВН=; ЧГ=") + Формат(ЧК_, "ЧЦ=2; ЧН=00; ЧВН=; ЧГ=") + Формат(МК_, "ЧЦ=2; ЧН=00; ЧВН=; ЧГ=") + "00");
	
	Д.Записать();
	
	
	УстановитьДатуВАдминке(Д.Номер, ДатаДоставки);
	
	Д_ = Документы.РеализацияТоваровУслуг.НайтиПоНомеру(Д.Номер);  // , Д.Дата
	Если Не Д_.Пустая() Тогда
		Док = Д_.ПолучитьОбъект();
		Док.Дата = ДатаДоставки;
		Док.Записать(РежимЗаписиДокумента.Запись);
		Если Док.Проведен Тогда
			Док.Записать(РежимЗаписиДокумента.Проведение);
		КонецеСли;	
	КонецеСли;	
	
КонецПроцедуры	


Процедура ОбработкаУдаленияПроведения(Отказ)
	Если ПричинаИзмененияДаты = Перечисления.ПричиныИзмененияДатыДоставки.НеПривезлиСоСклада 
		ИЛИ ПричинаИзмененияДаты = Перечисления.ПричиныИзмененияДатыДоставки.ВыгрузкаИзСистемыАксиомус Тогда
		ОткатитьДатуДоставки();
	КонецеСли;	
КонецПроцедуры


Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	//Асеев 27.11.2020 (Задача № 4359)>>>
	Если РежимЗаписи = РежимЗаписиДокумента.Проведение И Проведен Тогда
		ДополнительныеСвойства.Вставить("Перепроведение");
	КонецЕсли;
	//Асеев 27.11.2020 (Задача № 4359)<<<
	
	Если ЗначениеЗаполнено(Доставка) Тогда 
		НомерЗаказа = Доставка.Номер;
	Иначе
		НомерЗаказа = Заказ.Номер;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Доставка) И (Не ЗначениеЗаполнено(Рейс) ИЛИ Не ЗначениеЗаполнено(Заказ)) Тогда // Задача № 2991
		УстановитьЗаказРейсВДокумент();
	КонецЕсли;	
	
	ЗапросОзон = Новый Запрос("ВЫБРАТЬ
	                          |	ЕСТЬNULL(ДополнительныеПараметрыЗаказа.ШтрихкодOZON, """") КАК ШтрихкодOZON,
	                          |	ДополнительныеПараметрыЗаказа.Заказ
	                          |ИЗ
	                          |	РегистрСведений.ДополнительныеПараметрыЗаказа КАК ДополнительныеПараметрыЗаказа
	                          |ГДЕ
	                          |	ДополнительныеПараметрыЗаказа.Заказ.Номер = &НомерЗаказа");
	ЗапросОзон.УстановитьПараметр("НомерЗаказа", НомерЗаказа);	
	РезОзон = ЗапросОзон.Выполнить().Выбрать();
	
	Если РезОзон.Следующий() И РезОзон.ШтрихкодOZON <> "" Тогда  
	//Если РезОзон.Следующий() И РезОзон.ШтрихкодOZON <> "" И НачалоДня(ДатаДоставки) <> НачалоДня(Заказ.Дата) Тогда
		
		Запрос = новый Запрос("ВЫБРАТЬ
		                      |	ИзменениеДатыДоставки.Ссылка
		                      |ИЗ
		                      |	Документ.ИзменениеДатыДоставки КАК ИзменениеДатыДоставки
		                      |ГДЕ
		                      |	ИзменениеДатыДоставки.Проведен
		                      |	И ИзменениеДатыДоставки.Доставка = &Доставка
		                      |	И ИзменениеДатыДоставки.Ссылка <> &Ссылка");
		Запрос.УстановитьПараметр("Доставка", Доставка);
		Запрос.УстановитьПараметр("Ссылка", Ссылка);
		Если НЕ Запрос.Выполнить().Пустой() Тогда	
		
			Д = Доставка.ПолучитьОбъект();
			Д.Дата = ДатаДоставки;
			
			ЧН = Час(Д.ВремяОтправленияС);
			ЧК = Час(Д.ВремяОтправленияПо);
			
			МН = Минута(Д.ВремяОтправленияС);
			МК = Минута(Д.ВремяОтправленияПо);
			
			ЧН_ = Час(Д.ВремяПрибытияС);
			ЧК_ = Час(Д.ВремяПрибытияПо);
			
			МН_ = Минута(Д.ВремяПрибытияС);
			МК_ = Минута(Д.ВремяПрибытияПо);
			
			ВремяПрибытияС = Формат(День(ДатаДоставки), "ЧЦ=2; ЧВН=; ЧГ=") + "." + Формат(Месяц(ДатаДоставки), "ЧЦ=2; ЧВН=; ЧГ=")  + "." + Формат(Год(ДатаДоставки), "ЧГ=") + " " +Формат(ЧН_, "ЧЦ=2; ЧН=00; ЧВН=; ЧГ=") + ":" + Формат(МН_, "ЧЦ=2; ЧН=00; ЧВН=; ЧГ=");
			ВремяПрибытияПо = Формат(День(ДатаДоставки), "ЧЦ=2; ЧВН=; ЧГ=") + "." + Формат(Месяц(ДатаДоставки), "ЧЦ=2; ЧВН=; ЧГ=")  + "." + Формат(Год(ДатаДоставки), "ЧГ=") + " " +Формат(ЧК_, "ЧЦ=2; ЧН=00; ЧВН=; ЧГ=") + ":" + Формат(МК_, "ЧЦ=2; ЧН=00; ЧВН=; ЧГ=");
			
			Рез = oz_РаботаССервисом.PostingDeliveryDateChange(РезОзон.ШтрихкодOZON, ВремяПрибытияС, ВремяПрибытияПо, РезОзон.Заказ, Ссылка);	
			
			ВыгруженоВOZONE = Истина;
		
		КонецЕсли;
		
	КонецЕсли;
	
	
КонецПроцедуры


// Задача № 2991
Процедура УстановитьЗаказРейсВДокумент()
		
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	&Дата КАК Дата,
		|	ВЫРАЗИТЬ(&Доставка КАК БизнесПроцесс.новаМестнаяДоставка) КАК Доставка
		|ПОМЕСТИТЬ ВТ_Документ
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_Документ.Дата КАК Дата,
		|	ВТ_Документ.Доставка КАК Доставка,
		|	ВЫБОР
		|		КОГДА &Заказ = ЗНАЧЕНИЕ(Документ.РеализацияТоваровУслуг.ПустаяССылка)
		|			ТОГДА РеализацияТоваровУслуг.Ссылка
		|		ИНАЧЕ &Заказ
		|	КОНЕЦ КАК Заказ
		|ПОМЕСТИТЬ ВТ_Документ2
		|ИЗ
		|	ВТ_Документ КАК ВТ_Документ
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.РеализацияТоваровУслуг КАК РеализацияТоваровУслуг
		|		ПО ВТ_Документ.Доставка.Номер = РеализацияТоваровУслуг.Номер
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_Документ2.Дата КАК Дата,
		|	ВТ_Документ2.Доставка КАК Доставка,
		|	ВТ_Документ2.Заказ КАК Заказ,
		|	РейсЗаказы.Ссылка КАК Рейс
		|ПОМЕСТИТЬ ВТ_ПромИтог
		|ИЗ
		|	ВТ_Документ2 КАК ВТ_Документ2
		|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.Рейс.Заказы КАК РейсЗаказы
		|		ПО ВТ_Документ2.Заказ = РейсЗаказы.Заказ
		|			И (НАЧАЛОПЕРИОДА(РейсЗаказы.Ссылка.Дата, ДЕНЬ) <= НАЧАЛОПЕРИОДА(ВТ_Документ2.Дата, ДЕНЬ))
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_ПромИтог.Дата КАК Дата,
		|	ВТ_ПромИтог.Доставка КАК Доставка,
		|	ВТ_ПромИтог.Заказ КАК Заказ,
		|	МАКСИМУМ(ВТ_ПромИтог.Рейс) КАК Рейс
		|ИЗ
		|	ВТ_ПромИтог КАК ВТ_ПромИтог
		|
		|СГРУППИРОВАТЬ ПО
		|	ВТ_ПромИтог.Дата,
		|	ВТ_ПромИтог.Доставка,
		|	ВТ_ПромИтог.Заказ";
	
	Запрос.УстановитьПараметр("Доставка", Доставка);
	Запрос.УстановитьПараметр("Заказ", Заказ);
	Запрос.УстановитьПараметр("Дата", ?(Ссылка.Пустая(), ТекущаяДата(), Дата));	
	
	РезультатЗапроса = Запрос.Выполнить().Выбрать();
	
	
	Если  РезультатЗапроса.Следующий() Тогда

		Если Не ЗначениеЗаполнено(Заказ) Тогда
			
			Заказ  = РезультатЗапроса.Заказ;
			
		КонецЕсли;	
		
		Если Не ЗначениеЗаполнено(Рейс) Тогда
			
			Рейс  = РезультатЗапроса.Рейс;
			
		КонецЕсли;	
		
	КонецЕсли;	
	
Конецпроцедуры
